In [ ]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [ ]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [ ]:
X = df.drop(['Survived'], axis='columns')
y = df.Survived

In [ ]:
dummies = pd.get_dummies(X.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [ ]:
X = pd.concat([X,dummies],axis='columns')
X.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [ ]:
X.drop(['Sex'], axis='columns', inplace=True)
X.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [ ]:
# Finding out if there are any NA values in any of the columns
X.columns[X.isna().any()]

Index(['Age'], dtype='object')

In [ ]:
X.Age = X.Age.fillna(X.Age.mean())
X.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [ ]:
# Splitting our dataset into training and testing using sklearn
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2)

In [ ]:
# Creating Naive Bayes model
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [ ]:
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [ ]:
model.score(X_test, y_test)

0.8156424581005587

In [ ]:
model.predict(X_test[:10])

array([0, 1, 0, 0, 0, 1, 1, 1, 1, 1])

In [ ]:
model.predict_proba(X_test[:10])

array([[9.87951133e-01, 1.20488670e-02],
       [3.23824655e-02, 9.67617534e-01],
       [9.85579908e-01, 1.44200919e-02],
       [9.87882476e-01, 1.21175241e-02],
       [9.85760819e-01, 1.42391807e-02],
       [5.26206919e-02, 9.47379308e-01],
       [6.09215618e-02, 9.39078438e-01],
       [2.66118620e-02, 9.73388138e-01],
       [1.08617760e-36, 1.00000000e+00],
       [3.71428930e-02, 9.62857107e-01]])